      ******************************************************************
      * Author:
      * Date:
      * Purpose:
      * Tectonics: cobc
      ******************************************************************
       IDENTIFICATION DIVISION.
       PROGRAM-ID. YOUR-PROGRAM-NAME.
       DATA DIVISION.
       FILE SECTION.
       WORKING-STORAGE SECTION.
       PROCEDURE DIVISION.
       MAIN-PROCEDURE.
      *      C:\Users\rarsilva\Documents\GitHub\COBOL
            DISPLAY "PRAGRAMA CHAMADO"

            CALL 'CHAMADO'


            STOP RUN.
       END PROGRAM YOUR-PROGRAM-NAME.
