      ******************************************************************
      * Author:RARIKMILKRAI SOUZA
      * Date:30/08/22
      * Purpose:
      * Tectonics: cobc
      ******************************************************************
       IDENTIFICATION DIVISION.
       PROGRAM-ID. exeo3.
       DATA DIVISION.
       FILE SECTION.
       WORKING-STORAGE SECTION.
       77 WS-MOSTRA               PIC X(10) VALUE'MENSAGEM'.
       PROCEDURE DIVISION.
       MAIN-PROCEDURE.

            DISPLAY "Hello world"  45  WS-MOSTRA.

            STOP RUN.
       END PROGRAM exeo3.
